content/golang/lang/module.org
# -*- coding:utf-8-*-
#+TITLE: modules
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com

* 概述

  模块是相关的 Go 软件包的集合。

  模块是源代码交换和版本控制的单元。

  go 命令直接支持使用模块，包括记录和解决模块间依赖。

  模块取代了旧的基于 GOPATH 的方法来指定构建使用的源代码。


** Module support

   The go command includes support for Go modules. Module-aware mode is active by default whenever a go.mod file is found in the current directory or in any parent directory.

   The quickest way to take advantage of module support is to check out your repository, create a go.mod file (described in the next section) there, and run go commands from within that file tree.

   For more fine-grained control, the go command continues to respect a temporary environment variable, GO111MODULE, which can be set to one of three string values: off, on, or auto (the default).

   If GO111MODULE=on, then the go command requires the use of modules, never consulting GOPATH. We refer to this as the command being module-aware or running in "module-aware mode".

   If GO111MODULE=off, then the go command never uses module support. Instead it looks in vendor directories and GOPATH
to find dependencies; we now refer to this as "GOPATH mode."

   If GO111MODULE=auto or is unset, then the go command enables or disables module support based on the current directory.
Module support is enabled only when the current directory contains a go.mod file or is below a directory containing a go.mod file.

   In module-aware mode, GOPATH no longer defines the meaning of imports during a build, but it still stores downloaded dependencies (in GOPATH/pkg/mod) and installed commands (in GOPATH/bin, unless GOBIN is set).

* Defining a module

  A module is defined by a tree of Go source files with a go.mod file in the tree's root directory. The directory containing the go.mod file is called the module root. Typically the module root will also correspond to a source code repository root (but in general it need not).

  The module is the set of all Go packages in the module root and its subdirectories, but excluding subtrees with their own go.mod files.

  The "module path" is the import path prefix corresponding to the module root.

  The go.mod file defines the module path and lists the specific versions of other modules that should be used when resolving imports during a build, by giving their module paths and versions.

  For example, this go.mod declares that the directory containing it is the root of the module with path example.com/m, and it also declares that the module depends on specific versions of golang.org/x/text and gopkg.in/yaml.v2:

  #+BEGIN_SRC go
module example.com/m

require (
	golang.org/x/text v0.3.0
	gopkg.in/yaml.v2 v2.1.0
)
  #+END_SRC


  The go.mod file can also specify replacements and excluded versions that only apply when building the module directly; they are ignored when the module is incorporated into a larger build. For more about the go.mod file, see 'go help go.mod'.

  To start a new module, simply create a go.mod file in the root of the module's directory tree, containing only a module statement.

  The 'go mod init' command can be used to do this:
  #+BEGIN_SRC sh
go mod init example.com/m
  #+END_SRC


  In a project already using an existing dependency management tool like godep, glide, or dep, 'go mod init' will also add require statements matching the existing configuration.

  Once the go.mod file exists, no additional steps are required: go commands like 'go build', 'go test', or even 'go list' will automatically add new dependencies as needed to satisfy imports.

** The main module and the build list

   The "main module" is the module containing the directory where the go command is run. The go command finds the module root by looking for a go.mod in the current directory, or else the current directory's parent directory, or else the parent's parent directory, and so on.

   The main module's go.mod file defines the precise set of packages available for use by the go command, through require, replace, and exclude statements. Dependency modules, found by following require statements, also contribute to the definition of that set of packages, but only through their go.mod files' require statements: any replace and exclude statements in dependency modules are ignored. The replace and exclude statements therefore allow the main module complete control over its own build, without also being subject to complete control by dependencies.

   The set of modules providing packages to builds is called the "build list". The build list initially contains only the main module. Then the go command adds to the list the exact module versions required by modules already on the list, recursively, until there is nothing left to add to the list. If multiple versions of a particular module are added to the list, then at the end only the latest version (according to semantic version ordering) is kept for use in the build.

   The 'go list' command provides information about the main module and the build list. For example:
   #+BEGIN_SRC sh
go list -m              # print path of main module
go list -m -f={{.Dir}}  # print root directory of main module
go list -m all          # print build list
   #+END_SRC


