golang/lang/module.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-14 Mon 13:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>modules</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">modules</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8b6cae2">1. 概述</a>
<ul>
<li><a href="#org5a0783d">1.1. Module support</a></li>
</ul>
</li>
<li><a href="#orge714dcb">2. Defining a module</a>
<ul>
<li><a href="#org1dae719">2.1. The main module and the build list</a></li>
<li><a href="#orgb04da2f">2.2. Maintaining module requirements</a></li>
<li><a href="#orga2e95c5">2.3. Pseudo-versions</a></li>
<li><a href="#orgadae22c">2.4. Module queries</a></li>
<li><a href="#orgbe42e3f">2.5. Module compatibility and semantic versioning</a></li>
<li><a href="#orgb4f0a2b">2.6. Module code layout</a></li>
<li><a href="#org478fc05">2.7. Module downloading and verification</a></li>
<li><a href="#org7f40085">2.8. Modules and vendoring</a></li>
</ul>
</li>
<li><a href="#org8384542">3. GoProxy</a></li>
<li><a href="#org09db57e">4. 子命令</a></li>
<li><a href="#org3edaf30">5. RePlace</a></li>
<li><a href="#orgff861b3">6. GOPRIVATE</a></li>
<li><a href="#org97582ea">7. GOSUMDB</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8b6cae2" class="outline-2">
<h2 id="org8b6cae2"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
模块是相关的 Go 软件包的集合。
</p>

<p>
模块是源代码交换和版本控制的单元。
</p>

<p>
go 命令直接支持使用模块，包括记录和解决模块间依赖。
</p>

<p>
模块取代了旧的基于 GOPATH 的方法来指定构建使用的源代码。
</p>
</div>


<div id="outline-container-org5a0783d" class="outline-3">
<h3 id="org5a0783d"><span class="section-number-3">1.1</span> Module support</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The go command includes support for Go modules. Module-aware mode is active by default whenever a go.mod file is found in the current directory or in any parent directory.
</p>

<p>
The quickest way to take advantage of module support is to check out your repository, create a go.mod file (described in the next section) there, and run go commands from within that file tree.
</p>

<p>
For more fine-grained control, the go command continues to respect a temporary environment variable, GO111MODULE, which can be set to one of three string values: off, on, or auto (the default).
</p>

<p>
If GO111MODULE=on, then the go command requires the use of modules, never consulting GOPATH. We refer to this as the command being module-aware or running in "module-aware mode".
</p>

<p>
   If GO111MODULE=off, then the go command never uses module support. Instead it looks in vendor directories and GOPATH
to find dependencies; we now refer to this as "GOPATH mode."
</p>

<p>
   If GO111MODULE=auto or is unset, then the go command enables or disables module support based on the current directory.
Module support is enabled only when the current directory contains a go.mod file or is below a directory containing a go.mod file.
</p>

<p>
In module-aware mode, GOPATH no longer defines the meaning of imports during a build, but it still stores downloaded dependencies (in GOPATH/pkg/mod) and installed commands (in GOPATH/bin, unless GOBIN is set).
</p>
</div>
</div>
</div>

<div id="outline-container-orge714dcb" class="outline-2">
<h2 id="orge714dcb"><span class="section-number-2">2</span> Defining a module</h2>
<div class="outline-text-2" id="text-2">
<p>
A module is defined by a tree of Go source files with a go.mod file in the tree's root directory. The directory containing the go.mod file is called the module root. Typically the module root will also correspond to a source code repository root (but in general it need not).
</p>

<p>
The module is the set of all Go packages in the module root and its subdirectories, but excluding subtrees with their own go.mod files.
</p>

<p>
The "module path" is the import path prefix corresponding to the module root.
</p>

<p>
The go.mod file defines the module path and lists the specific versions of other modules that should be used when resolving imports during a build, by giving their module paths and versions.
</p>

<p>
For example, this go.mod declares that the directory containing it is the root of the module with path example.com/m, and it also declares that the module depends on specific versions of golang.org/x/text and gopkg.in/yaml.v2:
</p>

<div class="org-src-container">
<pre class="src src-go">module <span style="color: #00ff00;">example.com</span>/m

<span style="color: #0000ff; font-weight: bold;">require</span> (
    golang.org/x/text <span style="color: #00ff00;">v0.3</span>.0
    gopkg.in/yaml.v2 <span style="color: #00ff00;">v2.1</span>.0
)
</pre>
</div>


<p>
The go.mod file can also specify replacements and excluded versions that only apply when building the module directly; they are ignored when the module is incorporated into a larger build. For more about the go.mod file, see 'go help go.mod'.
</p>

<p>
To start a new module, simply create a go.mod file in the root of the module's directory tree, containing only a module statement.
</p>

<p>
The 'go mod init' command can be used to do this:
</p>
<div class="org-src-container">
<pre class="src src-sh">go mod init example.com/m
</pre>
</div>


<p>
In a project already using an existing dependency management tool like godep, glide, or dep, 'go mod init' will also add require statements matching the existing configuration.
</p>

<p>
Once the go.mod file exists, no additional steps are required: go commands like 'go build', 'go test', or even 'go list' will automatically add new dependencies as needed to satisfy imports.
</p>
</div>

<div id="outline-container-org1dae719" class="outline-3">
<h3 id="org1dae719"><span class="section-number-3">2.1</span> The main module and the build list</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The "main module" is the module containing the directory where the go command is run. The go command finds the module root by looking for a go.mod in the current directory, or else the current directory's parent directory, or else the parent's parent directory, and so on.
</p>

<p>
The main module's go.mod file defines the precise set of packages available for use by the go command, through require, replace, and exclude statements. Dependency modules, found by following require statements, also contribute to the definition of that set of packages, but only through their go.mod files' require statements: any replace and exclude statements in dependency modules are ignored. The replace and exclude statements therefore allow the main module complete control over its own build, without also being subject to complete control by dependencies.
</p>

<p>
The set of modules providing packages to builds is called the "build list". The build list initially contains only the main module. Then the go command adds to the list the exact module versions required by modules already on the list, recursively, until there is nothing left to add to the list. If multiple versions of a particular module are added to the list, then at the end only the latest version (according to semantic version ordering) is kept for use in the build.
</p>

<p>
The 'go list' command provides information about the main module and the build list. For example:
</p>
<div class="org-src-container">
<pre class="src src-sh">go list -m              <span style="color: #ffff00;"># </span><span style="color: #ffff00;">print path of main module</span>
go list -m -f={{.Dir}}  <span style="color: #ffff00;"># </span><span style="color: #ffff00;">print root directory of main module</span>
go list -m all          <span style="color: #ffff00;"># </span><span style="color: #ffff00;">print build list</span>
</pre>
</div>
</div>
</div>
