golang/lang/module.html

<div id="outline-container-orgadae22c" class="outline-3">
<h3 id="orgadae22c"><span class="section-number-3">2.4</span> Module queries</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The go command accepts a "module query" in place of a module version both on the command line and in the main module's go.mod file. (After evaluating a query found in the main module's go.mod file, the go command updates the file to replace the query with its result.)
</p>

<p>
A fully-specified semantic version, such as "v1.2.3", evaluates to that specific version.
</p>

<p>
A semantic version prefix, such as "v1" or "v1.2", evaluates to the latest available tagged version with that prefix.
</p>

<p>
A semantic version comparison, such as "&lt;v1.2.3" or "&gt;=v1.5.6", evaluates to the available tagged version nearest to the comparison target (the latest version for &lt; and &lt;=, the earliest version for &gt; and &gt;=).
</p>

<p>
The string "latest" matches the latest available tagged version, or else the underlying source repository's latest untagged revision.
</p>

<p>
The string "upgrade" is like "latest", but if the module is currently required at a later version than the version "latest" would select (for example, a newer pre-release version), "upgrade" will select the later version instead.
</p>

<p>
The string "patch" matches the latest available tagged version of a module with the same major and minor version numbers as the currently required version. If no version is currently required, "patch" is equivalent to "latest".
</p>

<p>
A revision identifier for the underlying source repository, such as a commit hash prefix, revision tag, or branch name, selects that semantic version, the query evaluates to that semantic version. Otherwise the query evaluates to a pseudo-version for the commit.
</p>

<p>
Note that branches and tags with names that are matched by other query syntax cannot be selected this way. For example, the query "v2" means the latest version starting with "v2", not the branch named "v2".
</p>

<p>
   All queries prefer release versions to pre-release versions. For example, "&lt;v1.2.3" will prefer to return "v1.2.2"
instead of "v1.2.3-pre1", even though "v1.2.3-pre1" is nearer to the comparison target.
</p>

<p>
   Module versions disallowed by exclude statements in the main module's go.mod are considered unavailable and cannot
be returned by queries.
</p>

<p>
For example, these commands are all valid:
</p>
<div class="org-src-container">
<pre class="src src-sh">go get github.com/gorilla/mux@latest    <span style="color: #ffff00;"># </span><span style="color: #ffff00;">same (@latest is default for 'go get')</span>
go get github.com/gorilla/mux@v1.6.2    <span style="color: #ffff00;"># </span><span style="color: #ffff00;">records v1.6.2</span>
go get github.com/gorilla/mux@e3702bed2 <span style="color: #ffff00;"># </span><span style="color: #ffff00;">records v1.6.2</span>
go get github.com/gorilla/mux@c856192   <span style="color: #ffff00;"># </span><span style="color: #ffff00;">records v0.0.0-20180517173623-c85619274f5d</span>
go get github.com/gorilla/mux@master    <span style="color: #ffff00;"># </span><span style="color: #ffff00;">records current meaning of master</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgbe42e3f" class="outline-3">
<h3 id="orgbe42e3f"><span class="section-number-3">2.5</span> Module compatibility and semantic versioning</h3>
<div class="outline-text-3" id="text-2-5">
<p>
   The go command requires that modules use semantic versions and expects that the versions accurately describe compatibility: it assumes that v1.5.4 is a backwards-compatible replacement for v1.5.3, v1.4.0, and even v1.0.0.
More generally the go command expects that packages follow the "import compatibility rule", which says:
</p>

<p>
"If an old package and a new package have the same import path, the new package must be backwards compatible with the old package."
</p>

<p>
Because the go command assumes the import compatibility rule, a module definition can only set the minimum required version of one of its dependencies: it cannot set a maximum or exclude selected versions. Still, the import compatibility rule is not a guarantee: it may be that v1.5.4 is buggy and not a backwards-compatible replacement for v1.5.3. Because of this, the go command never updates from an older version to a newer version of a module unasked.
</p>

<p>
In semantic versioning, changing the major version number indicates a lack of backwards compatibility with earlier versions. To preserve import compatibility, the go command requires that modules with major version v2 or later use a module path with that major version as the final element.
</p>

<p>
   For example, version v2.0.0 of example.com/m must instead use module path example.com/m/v2, and packages in that module would use that path as their import path prefix, as in example.com/m/v2/sub/pkg. Including the major version number in the module path and import paths in this way is called "semantic import versioning". Pseudo-versions for modules with major
version v2 and later begin with that major version instead of v0, as in v2.0.0-20180326061214-4fc5987536ef.
</p>

<p>
As a special case, module paths beginning with gopkg.in/ continue to use the conventions established on that system: the major version is always present, and it is preceded by a dot instead of a slash: gopkg.in/yaml.v1 and gopkg.in/yaml.v2, not gopkg.in/yaml and gopkg.in/yaml/v2.
</p>

<p>
The go command treats modules with different module paths as unrelated: it makes no connection between example.com/m and example.com/m/v2. Modules with different major versions can be used together in a build and are kept separate by the fact that their packages use different import paths.
</p>

<p>
In semantic versioning, major version v0 is for initial development, indicating no expectations of stability or backwards compatibility. Major version v0 does not appear in the module path, because those versions are preparation for v1.0.0, and v1 does not appear in the module path either.
</p>

<p>
Code written before the semantic import versioning convention was introduced may use major versions v2 and later to describe the same set of unversioned import paths as used in v0 and v1. To accommodate such code, if a source code repository has a v2.0.0 or later tag for a file tree with no go.mod, the version is considered to be part of the v1 module's available versions and is given an +incompatible suffix when converted to a module version, as in v2.0.0+incompatible. The +incompatible tag is also applied to pseudo-versions derived from such versions, as in v2.0.1-0.yyyymmddhhmmss-abcdefabcdef+incompatible.
</p>

<p>
In general, having a dependency in the build list (as reported by 'go list -m all') on a v0 version, pre-release version, pseudo-version, or +incompatible version is an indication that problems are more likely when upgrading that dependency, since there is no expectation of compatibility for those.
</p>

<p>
See <a href="https://research.swtch.com/vgo-import">https://research.swtch.com/vgo-import</a> for more information about semantic import versioning, and see <a href="https://semver.org/">https://semver.org/</a> for more about semantic versioning.
</p>
</div>
</div>

<div id="outline-container-orgb4f0a2b" class="outline-3">
<h3 id="orgb4f0a2b"><span class="section-number-3">2.6</span> Module code layout</h3>
<div class="outline-text-3" id="text-2-6">
<p>
For now, see <a href="https://research.swtch.com/vgo-module">https://research.swtch.com/vgo-module</a> for information about how source code in version control systems is mapped to module file trees.
</p>
</div>
</div>
