golang/lang/module.html

<div id="outline-container-org478fc05" class="outline-3">
<h3 id="org478fc05"><span class="section-number-3">2.7</span> Module downloading and verification</h3>
<div class="outline-text-3" id="text-2-7">
<p>
The go command can fetch modules from a proxy or connect to source control servers directly, according to the setting of the GOPROXY environment variable (see 'go help env'). The default setting for GOPROXY is "<a href="https://proxy.golang.org,direct">https://proxy.golang.org,direct</a>", which means to try the Go module mirror run by Google and fall back to a direct connection if the proxy reports that it does not have the module (HTTP error 404 or 410). See <a href="https://proxy.golang.org/privacy">https://proxy.golang.org/privacy</a> for the service's privacy policy.
</p>

<p>
If GOPROXY is set to the string "direct", downloads use a direct connection to source control servers. Setting GOPROXY to "off" disallows downloading modules from any source. Otherwise, GOPROXY is expected to be a comma-separated list of the URLs of module proxies, in which case the go command will fetch modules from those proxies. For each request, the go command tries each proxy in sequence, only moving to the next if the current proxy returns a 404 or 410 HTTP response. The string "direct" may appear in the proxy list, to cause a direct connection to be attempted at that point in the search. Any proxies listed after "direct" are never consulted.
</p>

<p>
The GOPRIVATE and GONOPROXY environment variables allow bypassing the proxy for selected modules. See 'go help module-private' for details.
</p>

<p>
No matter the source of the modules, the go command checks downloads against known checksums, to detect unexpected changes in the content of any specific module version from one day to the next. This check first consults the current module's go.sum file but falls back to the Go checksum database, controlled by the GOSUMDB and GONOSUMDB environment variables. See 'go help module-auth' for details.
</p>

<p>
See 'go help goproxy' for details about the proxy protocol and also the format of the cached downloaded packages.
</p>
</div>
</div>

<div id="outline-container-org7f40085" class="outline-3">
<h3 id="org7f40085"><span class="section-number-3">2.8</span> Modules and vendoring</h3>
<div class="outline-text-3" id="text-2-8">
<p>
When using modules, the go command typically satisfies dependencies by downloading modules from their sources and using those downloaded copies (after verification, as described in the previous section). Vendoring may be used to allow interoperation with older versions of Go, or to ensure that all files used for a build are stored together in a single file tree.
</p>

<p>
The command 'go mod vendor' constructs a directory named vendor in the main module's root directory that contains copies of all packages needed to support builds and tests of packages in the main module. 'go mod vendor' also creates the file vendor/modules.txt that contains metadata about vendored packages and module versions. This file should be kept consistent with go.mod: when vendoring is used, 'go mod vendor' should be run after go.mod is updated.
</p>

<p>
If the vendor directory is present in the main module's root directory, it will be used automatically if the "go" version in the main module's go.mod file is 1.14 or higher. Build commands like 'go build' and 'go test' will load packages from the vendor directory instead of accessing the network or the local module cache. To explicitly enable vendoring, invoke the go command with the flag -mod=vendor. To disable vendoring, use the flag -mod=mod.
</p>

<p>
Unlike vendoring in GOPATH, the go command ignores vendor directories in locations other than the main module's root directory.
</p>
</div>
</div>
</div>

<div id="outline-container-org8384542" class="outline-2">
<h2 id="org8384542"><span class="section-number-2">3</span> GoProxy</h2>
<div class="outline-text-2" id="text-3">
<p>
因为网络原因，在国内有些 package 不能使用 <code>go get</code> 直接下载或者下载速度比较慢，比如 <code>golang.org/x/xx</code> ， 一般有两种方法：
</p>
<ul class="org-ul">
<li>设置 http_proxy/https_proxy 让 go get 请求走代理。</li>
<li>官方提供了 GoProxy 环境变量，目前公开的 GOPROXY 有：
<ul class="org-ul">
<li>goproxy.io</li>
<li>七牛云提供的 <a href="https://github.com/goproxy/goproxy.cn/blob/master/README.zh-CN.md">goproxy.cn</a></li>
</ul></li>
</ul>


<p>
需要注意的是，Go 1.13 及后续版本中默认将 GOPROXY 设置为 <a href="https://proxy.golang.org">https://proxy.golang.org</a>， 国内无法使用这个源，需要手动改掉：
</p>
<div class="org-src-container">
<pre class="src src-sh">go env -w <span style="color: #ffff00;">GOPROXY</span>=<span style="color: #00ff00;">"https://goproxy.cn,direct"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org09db57e" class="outline-2">
<h2 id="org09db57e"><span class="section-number-2">4</span> 子命令</h2>
<div class="outline-text-2" id="text-4">
<p>
go mod 支持的子命令如下:
</p>
<ul class="org-ul">
<li>download: 下载 modules 到本地缓存</li>
<li>edit: 提供一种命令行交互修改 go.mod 的方式</li>
<li>graph: 将 module 的依赖图在命令行打印出来，其实并不是很直观</li>
<li>init: 初始化 modules，会生成一个 go.mod 文件</li>
<li>tidy: 清理 go.mod 中的依赖，会添加缺失的依赖，同时移除没有用到的依赖</li>
<li>vendor: 将依赖包打包拷贝到项目的 vendor 目录下，值得注意的是并不会将 test code 中的依赖包打包到 vendor 中。这种设计在社区也引起过几次争论，但是并没有达成一致。</li>
<li>verify: verify 用来检测依赖包自下载之后是否被改动过。</li>
<li>why: 解释为什么 package 或者 module 是需要，但是看上去解释的理由并不是非常的直观。</li>
</ul>
</div>
</div>


<div id="outline-container-org3edaf30" class="outline-2">
<h2 id="org3edaf30"><span class="section-number-2">5</span> RePlace</h2>
<div class="outline-text-2" id="text-5">
<p>
replace 主要用来解决包名发生变动的问题。
</p>

<p>
基于此操作， <a href="http://golang.org/x/">http://golang.org/x/</a> 不能下载的包，但是对应的包在 github 上面是有对应的目录，这个时候我们就可以将 go.mod 中的包进行 replace 操作。
</p>

<p>
下面是一个 Beego 项目的 go.mod 的 replace 的示例。
</p>
<pre class="example">
replace golang.org/x/crypto v0.0.0-20181127143415-eb0de9b17e85 =&gt; github.com/golang/crypto v0.0.0-20181127143415-eb0de9b17e85
replace gopkg.in/yaml.v2 v2.2.1 =&gt; github.com/go-yaml/yaml v0.0.0-20180328195020
</pre>
</div>
</div>


<div id="outline-container-orgff861b3" class="outline-2">
<h2 id="orgff861b3"><span class="section-number-2">6</span> GOPRIVATE</h2>
<div class="outline-text-2" id="text-6">
<p>
go 命令默认是从 proxy.golang.org 上的公共 Go 模块镜像下载模块。默认情况下，无论 package 来源如何，默认根据 sum.golang.org 上的公共 Go 校验和数据库来验证下载的模块。这些默认设置适用于公开可用的源代码。
</p>

<p>
go 命令通过 GOPRIVATE 环境变量识别哪个模块是私有的（不可公开获得），因此不应使用代理或校验和数据库。该变量是模块路径前缀的逗号分隔的全局模式列表（按照 Go 的 path.Match 的语法）。例如：
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffff00;">GOPRIVATE</span>=*.corp.example.com,rsc.io/private
</pre>
</div>

<p>
go 命令将路径前缀与任一模式匹配的任何模块视为私有模块，包括 <code>git.corp.example.com/xyzzy, rsc.io/private, and rsc.io/private/quux</code> 。
</p>

<p>
其他工具使用也可通过 GOPRIVATE 环境变量识别非公共模块。例如，编辑器可以使用 GOPRIVATE 来决定是否将软件包导入超链接到 godoc.org 页面。
</p>

<p>
为了对模块下载和验证进行细粒度控制，GONOPROXY 和 GONOSUMDB 环境变量接受相同类型的 glob 列表，并覆盖 GOPRIVATE 以分别决定是否使用代理和校验和数据库。
</p>

<p>
例如，如果公司运行了为私有模块提供服务的模块代理，则用户可以使用以下命令配置 go：
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffff00;">GOPRIVATE</span>=*.corp.example.com
<span style="color: #ffff00;">GOPROXY</span>=proxy.example.com
<span style="color: #ffff00;">GONOPROXY</span>=none
</pre>
</div>

<p>
这将告诉 go 命令和其他工具，以 <code>corp.example.com</code> 子域开头的模块是私有的，但是公司代理应该用于下载公共模块和私有模块，因为 GONOPROXY 已设置为不会匹配任何模块，覆盖 GOPRIVATE。
</p>

<p>
<code>go env -w</code> 命令（请参阅“ go help env”）可用于为以后的 go 命令调用设置这些变量。
</p>
</div>
</div>

<div id="outline-container-org97582ea" class="outline-2">
<h2 id="org97582ea"><span class="section-number-2">7</span> GOSUMDB</h2>
<div class="outline-text-2" id="text-7">
<p>
GOSUMDB 是一个环境变量， 的全称为 Go CheckSum Database，用来下载的包的安全性校验问题。包的安全性在使用 GoProxy 之后更容易出现，比如我们引用了一个不安全的 GoProxy pv 之后然后下载了一个不安全的包，这个时候就出现了安全性问题。对于这种情况，可以通过 GOSUMDB 来对包的哈希值进行校验。当然如果想要关闭哈希校验，可以将 GOSUMDB 设置为 off；如果要对部分包关闭哈希校验，则可以将包的前缀设置到环境变量中 GONOSUMDB 中，设置规则类似 GOPRIVATE。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-09-14 Mon 13:20</p>
<p class="validation"></p>
</div>
</body>
</html>
